In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
os.chdir('D:\Project')

In [3]:
dataset = pd.read_csv("house_prices.csv")

In [4]:
dataset.head()

,area_type,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
dataset.shape

(13320, 8)

In [6]:
dataset2 = dataset.drop(['location','area_type','society','balcony'],axis='columns')

In [7]:
dataset2.head()

        size total_sqft  bath   price
0      2 BHK       1056   2.0   39.07
1  4 Bedroom       2600   5.0  120.00
2      3 BHK       1440   2.0   62.00
3      3 BHK       1521   3.0   95.00
4      2 BHK       1200   2.0   51.00

In [8]:
dataset2.isnull().sum()

size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [9]:
dataset3 = dataset2.dropna()

In [10]:
dataset3.isnull().sum()

size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [11]:
dataset3.shape

(13247, 4)

In [12]:
dataset3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [13]:
dataset3['bhk'] = dataset3['size'].apply(lambda x: int(x.split(' ')[0]))

<ipython-input-13-5e7ac6636162>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset3['bhk'] = dataset3['size'].apply(lambda x: int(x.split(' ')[0]))

In [14]:
dataset3.head()

        size total_sqft  bath   price  bhk
0      2 BHK       1056   2.0   39.07    2
1  4 Bedroom       2600   5.0  120.00    4
2      3 BHK       1440   2.0   62.00    3
3      3 BHK       1521   3.0   95.00    3
4      2 BHK       1200   2.0   51.00    2

In [15]:
dataset3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [16]:
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [17]:
convert_sqft_to_num('101')

101.0

In [18]:
convert_sqft_to_num('100-120')

110.0

In [19]:
print(convert_sqft_to_num('101meter'))

None

In [20]:
dataset4 = dataset3.copy()

In [21]:
dataset4['total_sqft'] = dataset4['total_sqft'].apply(convert_sqft_to_num)

In [22]:
dataset4['total_sqft'].isna().sum()

46

In [23]:
dataset5 = dataset4.dropna()

In [24]:
dataset4['total_sqft'].isna().sum()

46

In [25]:
dataset4['total_sqft'].isna().sum()
dataset5 = dataset4.dropna()
dataset5.head()

        size  total_sqft  bath   price  bhk
0      2 BHK      1056.0   2.0   39.07    2
1  4 Bedroom      2600.0   5.0  120.00    4
2      3 BHK      1440.0   2.0   62.00    3
3      3 BHK      1521.0   3.0   95.00    3
4      2 BHK      1200.0   2.0   51.00    2

In [26]:
dataset6 = dataset5.drop(['size'],axis='columns')

In [27]:
dataset6.head()

   total_sqft  bath   price  bhk
0      1056.0   2.0   39.07    2
1      2600.0   5.0  120.00    4
2      1440.0   2.0   62.00    3
3      1521.0   3.0   95.00    3
4      1200.0   2.0   51.00    2

In [28]:
x = dataset6[['total_sqft','bath','bhk']]

In [29]:
x.head()

   total_sqft  bath  bhk
0      1056.0   2.0    2
1      2600.0   5.0    4
2      1440.0   2.0    3
3      1521.0   3.0    3
4      1200.0   2.0    2

In [30]:
y = dataset6[['price']]

In [31]:
y.head()

    price
0   39.07
1  120.00
2   62.00
3   95.00
4   51.00

In [32]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.3)

In [33]:
from sklearn.linear_model import LinearRegression

In [34]:
lr=LinearRegression()
lr.fit(x_train,y_train)

LinearRegression()

In [35]:
y_pred = lr.predict(x_test)

In [36]:
from sklearn.metrics import r2_score

In [37]:
r2_score(y_test,y_pred)

0.48443524972109386